English/NewWords/NewWords04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2013-05-25 六 20:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. mascot</a>
<ul>
<li><a href="#sec-1-1">1.1. connotation</a></li>
</ul>
</li>
<li><a href="#sec-2">2. ostrich</a></li>
<li><a href="#sec-3">3. farcture</a></li>
<li><a href="#sec-4">4. nuisance</a></li>
<li><a href="#sec-5">5. FWIW</a></li>
<li><a href="#sec-6">6. YMMV</a></li>
<li><a href="#sec-7">7. IMHO</a></li>
<li><a href="#sec-8">8. IMO</a></li>
<li><a href="#sec-9">9. FYI</a></li>
<li><a href="#sec-10">10. HAND</a></li>
<li><a href="#sec-11">11. AFAICS</a></li>
<li><a href="#sec-12">12. as per</a></li>
<li><a href="#sec-13">13. intimidate</a></li>
<li><a href="#sec-14">14. HTH</a></li>
<li><a href="#sec-15">15. ephemeral</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> mascot</h2>
<div class="outline-text-2" id="text-1">
<p>
吉祥物<br/>
</p>
<pre class="example">
First we shouldn't use the word `logo' with it's evil connotations of commerce.  Let us use the word `mascot' instead, since it's a living being.
</pre>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> connotation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
词语的涵义(an idea or a feeling that a word invokes for a person in addition to its literal or primary meaning )<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> ostrich</h2>
<div class="outline-text-2" id="text-2">
<p>
驼鸟<br/>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> farcture</h2>
<div class="outline-text-2" id="text-3">
<p>
v/n crack or break 破裂/断裂/骨折<br/>
</p>
<pre class="example">
It may seem to be a low-risk activity, but doctors say walking and texting can lead to people fracturing a limb or breaking their nose:
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> nuisance</h2>
<div class="outline-text-2" id="text-4">
<p>
令人讨厌的人或物或事<br/>
</p>
<pre class="example">
Since I don't want to save a local copy of the sent message (because Gmail SMTP and IMAP will get it for me anyway), I have to always say "no" before proceeding. This is a nuisance when it happens every time.
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> FWIW</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>for whoever is wondering<br/>
</li>
<li>for what is worth<br/>
<a href="http://english.stackexchange.com/questions/24260/whats-the-difference-between-fwiw-and-imho">FWIW和IMHO的区别</a><br/>
FWIW强调你的看法可能不切中要害，不有一定的应用价值。 = I have no idea but ..<br/>
IMHO强调自己的看法。 = I think ..<br/>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> YMMV</h2>
<div class="outline-text-2" id="text-6">
<p>
your mileage may vary 你的可能不同<br/>
</p>
<pre class="example">
FWIW, I'm doing this on Emacs 23.2.1 on a Mac OS X box. YMMV.
</pre>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> IMHO</h2>
<div class="outline-text-2" id="text-7">
<p>
in my humble opinion<br/>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> IMO</h2>
<div class="outline-text-2" id="text-8">
<p>
in my opinion<br/>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> FYI</h2>
<div class="outline-text-2" id="text-9">
<p>
for your information 仅供参考<br/>
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> HAND</h2>
<div class="outline-text-2" id="text-10">
<p>
have a nice day<br/>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> AFAICS</h2>
<div class="outline-text-2" id="text-11">
<p>
as far as I can see<br/>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> as per</h2>
<div class="outline-text-2" id="text-12">
<p>
按照，根据（书面语）<br/>
</p>
<pre class="example">
As per my understanding, there is no such feature; and as a user, I would love it!
</pre>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> intimidate</h2>
<div class="outline-text-2" id="text-13">
<p>
v threaten/frighten 恫吓/威吓<br/>
intimidating adj frightening/threatening<br/>
intimidation<br/>
intimidator<br/>
</p>
<pre class="example">
The Gnus manual is a bit intimidating; is there any newbie-friendly tutorial which might help get me started.
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> HTH</h2>
<div class="outline-text-2" id="text-14">
<p>
Hope This Helps<br/>
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> ephemeral</h2>
<div class="outline-text-2" id="text-15">
<p>
短暂的<br/>
</p>
<pre class="example">
an ephemeral group Gnus中暂时的组
</pre>
</div>
</div>
</div>
</body>
</html>
